miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_basic/src/hw/r_usb_rx_mcu.c
#endif  /* defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) */

    }
}
/******************************************************************************
 End of function usb_cpu_int_enable
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cpu_int_disable
 Description     : USB Interrupt disable
 Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure.
 Return value    : void
 ******************************************************************************/
void usb_cpu_int_disable (usb_utr_t *ptr)
{
    if (USB_USBIP_0 == ptr->ip)
    {
        /* Interrupt enable register (USB0 USBIO disable)
         b0 IEN0 Interrupt enable bit
         b1 IEN1 Interrupt enable bit
         b2 IEN2 Interrupt enable bit
         b3 IEN3 Interrupt enable bit
         b4 IEN4 Interrupt enable bit
         b5 IEN5 Interrupt enable bit
         b6 IEN6 Interrupt enable bit
         b7 IEN7 Interrupt enable bit
         */
        IEN( USB0, USBI0 )= 0; /* Disable USB0 interrupt */
    }

    if (USB_USBIP_1 == ptr->ip)
    {
#if defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        /* Interrupt enable register (USB1 USBIO disable)
         b0 IEN0 Interrupt enable bit
         b1 IEN1 Interrupt enable bit
         b2 IEN2 Interrupt enable bit
         b3 IEN3 Interrupt enable bit
         b4 IEN4 Interrupt enable bit
         b5 IEN5 Interrupt enable bit
         b6 IEN6 Interrupt enable bit
         b7 IEN7 Interrupt enable bit
         */
        IEN( USBA, USBAR ) = 0u; /* Disnable USBA interrupt */

#endif  /* defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

#if defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N)
        /* Interrupt enable register (USB1 USBIO disable)
         b0 IEN0 Interrupt enable bit
         b1 IEN1 Interrupt enable bit
         b2 IEN2 Interrupt enable bit
         b3 IEN3 Interrupt enable bit
         b4 IEN4 Interrupt enable bit
         b5 IEN5 Interrupt enable bit
         b6 IEN6 Interrupt enable bit
         b7 IEN7 Interrupt enable bit
         */
        IEN( USB, USBR1 ) = 0u; /* Disable USB1 interrupt */

#endif  /* defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) */

    }
}
/******************************************************************************
 End of function usb_cpu_int_disable
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_chattaring
 Description     : Remove chattaring processing
 Arguments       : uint16_t *syssts : SYSSTS register value
 Return value    : LNST bit value
 ******************************************************************************/
uint16_t usb_chattaring (uint16_t *syssts)
{
    uint16_t lnst[4];

    while (1)
    {
        lnst[0] = (*syssts) & USB_LNST;
        usb_cpu_delay_xms((uint16_t) 1); /* 1ms wait */
        lnst[1] = (*syssts) & USB_LNST;
        usb_cpu_delay_xms((uint16_t) 1); /* 1ms wait */
        lnst[2] = (*syssts) & USB_LNST;
        if ((lnst[0] == lnst[1]) && (lnst[0] == lnst[2]))
        {
            break;
        }
    }
    return lnst[0];
}
/******************************************************************************
End of function usb_chattaring
******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */


/*******************************************************************************
 * Function Name: usbfs_usbi_isr
 * Description  : Interrupt service routine of USBF
 * Arguments    : none
 * Return Value : none
 *******************************************************************************/
static void usbfs_usbi_isr (void)
{
    /* Call USB interrupt routine */
    if (USB_HOST == g_usb_usbmode)
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        usb_hstd_usb_handler(); /* Call interrupt routine */

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
        usb_pstd_usb_handler(); /* Call interrupt routine */

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    ICU.PIBR7.BYTE |= 0x40; /* Flag clear */

#endif /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
}
/******************************************************************************
 End of function usbfs_usbi_isr
 ******************************************************************************/


#if defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX63N) || defined (BSP_MCU_RX62N)
/*******************************************************************************
 * Function Name: usbhs_usbir_isr
 * Description  : Interrupt service routine of USBF
 * Arguments    : none
 * Return Value : none
 *******************************************************************************/
static void usbhs_usbir_isr (void)
{
    /* Condition compilation by the difference of USB function */
    if (USB_HOST == g_usb_usbmode)
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
#if USB_NUM_USBIP == 2
        usb2_hstd_usb_handler(); /* Call interrupt routine */

#endif /* USB_NUM_USBIP == 2 */
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
        usb_pstd_usb_handler();

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
}
/******************************************************************************
 End of function usbhs_usbir_isr
 ******************************************************************************/
#endif /* defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) */

#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )

#if defined (BSP_MCU_RX64M) || defined (BSP_MCU_RX71M) || defined (BSP_MCU_RX65N)
/******************************************************************************
 Function Name   : usb_cpu_usb_int_hand_isr
 Description     :
 Arguments       : none
 Return value    : none
 ******************************************************************************/
static void usb_cpu_usb_int_hand_isr (void)
{
    hw_usb_pclear_sts_resm();
    ICU.IPR[IPR_USB0_USBR0].BYTE = 0x00; /* Priority Resume1=0 */
    ICU.IR[IR_USB0_USBR0].BIT.IR = 0; /* Interrupt Request USB_resume USBR1 Clear */
} /* End of function usb_cpu_usb_int_hand_isr */

#else  /* defined (BSP_MCU_RX64M) || defined (BSP_MCU_RX71M) || defined (BSP_MCU_RX65N) */
/******************************************************************************
 Function Name   : usb_cpu_usb_int_hand_isr
 Description     :
 Arguments       : none
 Return value    : none
 ******************************************************************************/
static void usb_cpu_usb_int_hand_isr (void)
{
    hw_usb_pclear_sts_resm();
    ICU.IPR[IPR_USB_USBR0].BYTE = 0x00; /* Priority Resume1=0 */
    ICU.IR[IR_USB_USBR0].BIT.IR = 0; /* Interrupt Request USB_resume USBR1 Clear */
} /* End of function usb_cpu_usb_int_hand_isr */

#endif /* defined (BSP_MCU_RX64M) || defined (BSP_MCU_RX71M) || defined (BSP_MCU_RX65N) */

